{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7d962e73",
   "metadata": {},
   "source": [
    "# Задание c использованием конструктива if else"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aab8a0c7",
   "metadata": {},
   "source": [
    "## Упражнение 1. Чет или нечет?\n",
    "Напишите программу, запрашивающую у пользователя целое число и вы-водящую на экран информацию о том, является введенное число четнымили нечетным.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a8f388a9",
   "metadata": {},
   "outputs": [],
   "source": [
    "a = input('Введите целое число: ')\n",
    "a = int(a)\n",
    "if a%2 == 0 :\n",
    "    print('Введеное вами число - четное')\n",
    "else:\n",
    "    print('Введеное вами число - нечетное')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "81614de6",
   "metadata": {},
   "source": [
    "## Упражнение 2. Англиские гласные и согласные\n",
    "Разработайте программу, запрашивающую у пользователя букву латинского алфавита. Если введенная буква входит в следующий список ( a, e, i,o или u), необходимо вывести сообщение о том, что эта буква гласная.\n",
    "Если была введена буква y, программа должна написать, что эта буква может быть как гласной, так и согласной. Во всех других случаях должно выводиться сообщение о том, что введена согласная буква\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1e482b46",
   "metadata": {},
   "outputs": [],
   "source": [
    "a = input('Введите любую букву латинского алфавита: ')\n",
    "if a in ('a', 'e', 'i', 'o', 'u'):\n",
    "    print('Вы ввели гласную букву')\n",
    "elif a == 'y':\n",
    "    print('Введенная вами буква может быть как гласной, так и согласной')\n",
    "else:\n",
    "    print('Введена согласная буква')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b9f4dd78",
   "metadata": {},
   "source": [
    "# Задание c использованием циклов"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b80748b0",
   "metadata": {},
   "source": [
    "## Упражнение 3 Таблица соотношения температур\n",
    "\n",
    "Напишите программу для вывода таблицы соотношения температур, выраженных в градусах Цельсия и Фаренгейта. В таблице должны размещаться все температуры между 0 и 100 градусами Цельсия, кратные 10. Дополните таблицу подходящими заголовками. Формулу для переводатемпературы из градусов Цельсия в градусы Фаренгейта можно легко найти на просторах интернета.\n",
    "'''\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "57ef7b75",
   "metadata": {},
   "outputs": [],
   "source": [
    "[воскресенье 16:55] Султанова Фатима Равильевна\n",
    "a = 'Градусы по Цельсию | Градусы по Фаренгейту'\n",
    "print(a)\n",
    "for i in range(len(a)):\n",
    "    print('-', end = '')\n",
    "print()\n",
    "for value in range(0, 110, 10):\n",
    "    if value == 0:\n",
    "        print(value, '                ', '|', int(value*9/5 + 32))\n",
    "    elif value == 100:\n",
    "        print(value, '              ', '|', int(value*9/5 + 32))\n",
    "    else:\n",
    "        print(value, '               ', '|', int(value*9/5 + 32))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7ddac016",
   "metadata": {},
   "source": [
    "\n",
    "## Упражнение 4. Простое число?\n",
    "Простое число представляет собой число, большее единицы, которое без\n",
    "остатка делится лишь на само себя и единицу. Напишите функцию для\n",
    "определения того, является ли введенное число простым. Возвращаемое\n",
    "значение должно быть либо True, либо False. В основной программе, как\n",
    "и ожидается, пользователь должен ввести целое число и получить ответ\n",
    "о том, является ли оно простым. Убедитесь, что основная программа небудет запускаться, если файл импортирован в другой файл в качестве\n",
    "модуля.\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "072dc701",
   "metadata": {},
   "outputs": [],
   "source": [
    "def simple_number(value):\n",
    "    if (value > 1):\n",
    "        for number in range (2, value):\n",
    "            if value % number != 0:\n",
    "                return True\n",
    "            else:\n",
    "                return False\n",
    "    else:\n",
    "        return False\n",
    "a = input('Введите число: ')\n",
    "a = int(a)\n",
    "simple_number(a)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78766eb9",
   "metadata": {},
   "source": [
    "# Упражнение 5. Подбрасываем монетку\n",
    "\n",
    "Какое минимальное количество раз вы должны подбросить монетку, что-бы три раза подряд выпал либо орел, либо решка? А какое максимальное количество попыток может для этого понадобиться? А в среднем? В данном упражнении мы выясним это, создав симулятор подбрасывания виртуальной монетки.\n",
    "Напишите программу, использующую для подброса монетки генера-\n",
    "тор случайных чисел Python. Монетка при этом должна быть правильной формы, что означает равную вероятность выпадения орла и решки. Под брасывать монетку необходимо до тех пор, пока три раза подряд не выпадет одно значение, вне зависимости от того, орел это будет или решка.\n",
    "Выводите на экран букву О всякий раз, когда выпадает орел, и Р – когда выпадает решка. При этом для одной симуляции бросков все выпавшие значения необходимо размещать на одной строке. Также необходимо известить пользователя о том, сколько попыток потребовалось, чтобы получить нужный результат.\n",
    "Программа должна выполнить десять симуляций и в конце представить среднее количество подбрасываний монетки, требуемое для достижения нужного нам результата. <br>\n",
    "Пример вывода программы показан ниже: <br>\n",
    "О Р Р Р (попыток: 4) <br>\n",
    "О О Р Р О Р О Р Р О О Р О Р Р О Р Р Р (попыток: 19) <br>\n",
    "Р Р Р (попыток: 3) <br>\n",
    "Р О О О (попыток: 4) <br>\n",
    "О О О (попыток: 3) <br>\n",
    "Р О Р Р О Р О О Р Р О О Р О Р О О О (попыток: 18) <br>\n",
    "О Р Р О О О (попыток: 6) <br>\n",
    "Р О Р Р Р (попыток: 5) <br>\n",
    "Р Р О Р Р О Р О Р О О О (попыток: 12) <br>\n",
    "Р О Р Р Р (попыток: 5) <br>\n",
    "Среднее количество попыток: 7,9<br>\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d85fa9f7",
   "metadata": {},
   "outputs": [],
   "source": [
    "import random\n",
    "attempts = []\n",
    "for i in range(10):\n",
    "    count_o = 0\n",
    "    count_p = 0\n",
    "    throws = 0\n",
    "    while count_o < 3 and count_p < 3:\n",
    "        random_num = random.randint(0, 1)\n",
    "        if random_num == 0:\n",
    "            print(\"О\", end = '')\n",
    "            count_o += 1\n",
    "            count_p = 0\n",
    "        else:\n",
    "            print(\"P\", end = '')\n",
    "            count_p += 1\n",
    "            count_o = 0\n",
    "        throws += 1\n",
    "    print(\"(попыток: {})\".format(throws))\n",
    "    attempts.append(throws)\n",
    "print()\n",
    "print('Среднее количество попыток:', sum(attempts)/len(attempts))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
